 Importing the necessary libraries and creating a sample DataFrame

In [15]:
import numpy as np
import pandas as pd

# Create a sample DataFrame
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

**Adding a New Column:**

In [16]:
df['D'] = [10, 11, 12]
df

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

**Adding a New Row:**

In [17]:
new_row = pd.Series({'A': 4, 'B': 7, 'C': 10, 'D': 13})
df = df.append(new_row, ignore_index=True)
df

   A  B   C   D
0  1  4   7  10
1  2  5   8  11
2  3  6   9  12
3  4  7  10  13

**Deleting Rows and Columns:
To delete rows or columns, you can use the drop method**

In [14]:
# Drop a row by index
df = df.drop(1)
df

   A   C   D    B
0  1   7  10  NaN
2  4  10  13  NaN
3  4  10  13  7.0

In [7]:
# Drop a column by name
df = df.drop('B', axis=1)
df

   A   C   D
0  1   7  10
2  3   9  12
3  4  10  13

**Changing Column Order:
You can rearrange the order of columns using indexing**

In [6]:
df = df[['D', 'A', 'C']]
df

    D  A   C
0  10  1   7
2  12  3   9
3  13  4  10